import React from 'react';
import '../css/Gus.css'
import Runnum from "./../components/Runnum/Dfw-runnum.js";
class Gus extends React.Component{
	constructor(props){
		super();
		this.state={
			name:true,
			st:true,
		}
	}
	
	render(){
		return (
			<div className="Dfw-Gus">
				<Runnum value={['首页','阎王殿审判记录','闹阴司司马貌断狱']} />
				<h4 className="Dfw-tit">每逢疑狱便因循，地府阳间事体均。今日重湘新气象，千年怨气一朝伸。</h4>
				<p className="Dfw-col">东汉灵帝年间 判官记录</p>
				<div className="Dfw-item">
					<p>恩将恩报，仇将仇报，分毫不错。重湘口里发落，判官在傍用笔填注：何州何县何乡，姓甚名谁，几时生，几时死，细细开载。将人犯逐一唤过，发出投胎出世：“@韩信，你尽忠报国，替汉家夺下大半江山，可惜衔冤而死。发你在樵乡曹蒿家托生，姓曹，名操，表字孟德。先为汉相，后为魏王，坐镇许都，享有汉家山河之半。那时威权盖世，任从你谋报前世之仇。当身不得称帝，明你无叛汉之心；子受汉禅，追尊你为武帝，偿十大功劳也。”又唤过汉祖@刘邦发落：“你来生仍投入汉家，立为献帝，一生被@曹操欺侮，胆战魂惊，坐卧不安，度日如年。因前世君负其臣，来生臣欺其君以相报。”唤吕后发落：“你在伏家投胎，后日仍做献帝之后，被曹操千磨百难，将红罗勒死宫中，以报长乐宫杀信之仇。”</p>
					<p>@韩信问道：“@萧何发落何处？”重湘道：“萧何有恩于你，又有怨于你。”叫萧何发落：“你在杨家投胎，姓杨，名修，表字德祖。当初沛公入关之时，诸将争取金帛，偏你只取图籍；许你来生聪明盖世，悟性绝人，官为曹操主簿，大俸大禄，以报三荐之恩。不合参破曹操兵机，为操所杀：前生你哄韩信入长乐宫，来生偿其命也。”判官写得明白。</p>
					<p>又唤九江王@英布上来：“发你在江东孙坚家投胎，姓孙，名权，表字仲谋。先为吴王，后为吴帝，坐镇江东，享一国之富贵。”又唤@彭越上来：“你是个正直之人，发你在涿郡楼桑村刘弘家为男，姓刘，名备，字玄德。千人称仁，万人称义。后为蜀帝，抚有蜀中之地，与曹操、孙权三分鼎足。曹氏灭汉，你续汉家之后，乃表汝忠心也。”</p>
					<p>彭越道：“三分天下，是大乱之时，西蜀一隅之地，怎能敌得吴、魏？”重湘道：“我判几个人扶助你就是。”乃唤@蒯通上来：“你足智多谋，发你在南阳托生，复姓诸葛，名亮，表字孔明，号为卧龙。为刘备军师，共立江山。”又唤@许复上来：“你算韩信七十二岁之寿，只有三十二岁；虽然阴骘折堕，也是命中该载的。如今发你在襄阳投胎，姓庞，名统，表字士元，号为凤雏，帮刘备取西川。注定三十二岁，死于落凤坡之下，与韩信同寿，以为算命不准之报。今后算命之人，胡言哄人，如此折寿，必然警醒了。”</p>
					<p>越道：“军师虽有，必须良将帮扶。”重湘道：“有了。”唤过@樊哙：“发你范阳涿州张家投胎，名飞，字翼德。”又唤@项羽上来：“发你在蒲州解良关家投胎，只改姓不改名，姓关，名羽，字云长。你二人都有万夫不当之勇，与刘备桃园结义，共立基业。樊哙不合纵妻吕须帮助吕后为虐，妻罪坐夫。项羽不合杀害秦王子婴，火烧咸阳。二人都注定凶死。但樊哙生前忠勇，并无谄媚；项羽不杀太公，不污吕后，不于酒席上暗算人，有此三德，注定来生俱义勇刚直，死而为神。”再唤纪信过来：“你前生尽忠刘家，未得享受一日富贵，发你来生在常山赵家出世，名云，表字子龙，为西蜀名将。当阳长坂百万军中救主，大显威名。寿年八十二，无病而终。”又唤戚氏夫人：“发你在甘家出世，配刘备为正宫。吕氏当初慕彭王美貌，求淫不遂，又妒忌汉皇爱你，今断你与彭越为夫妇，使他妒不得也。赵王如意，仍与你为子，改名刘禅，小字阿斗，嗣位为后主，安享四十二年之富贵，以偿前世之苦。”</p>
				</div>
				<div className="Dfw-sen">
					<button>审批完成</button>
					<section>
						<p className="st"  onClick={()=>{
							if(this.state.st){
								document.querySelector('.st').style.background="#0099ff";
								this.setState({
									st:false
								})
							}else{
								document.querySelector('.st').style.background="#fff";
								this.setState({
									st:true
								})
							}
						}}><a></a></p><p>转发轮回司执行</p>
					</section>
					<section>
					<p className="ins"  onClick={()=>{
							if(this.state.name){
								document.querySelector('.ins').style.background="#0099ff";
								this.setState({
									name:false
								})
							}else{
								document.querySelector('.ins').style.background="#fff";
								this.setState({
									name:true
								})
							}
						}}><a></a></p><p>转发十八地狱执行</p>
					</section>
				</div>
			</div>
		)
	}
}


export default Gus